perf/jmx/N-P-08-rate-limit-degrade.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  N-P-08 限流降级验证测试计划
  <p>
  测试目标：触发限流后返回缓存、黑名单生效
  验证点：
  1. 超过热点参数限流阈值（2000 QPS）后，返回 Caffeine 缓存数据而非直接拒绝
  2. 超过 IP 限流阈值 10 次后，自动拉黑 1 小时，返回 403
  3. 限流降级响应不消耗幂等键
  </p>
  <p>
  小白理解：
  - 这个测试故意"搞破坏"，用超高并发冲垮接口，看系统怎么处理
  - 热点商品 ID=10086 配置了 2000 QPS 的特殊阈值，超过后应该返回缓存数据（不是 429 错误）
  - 同一个 IP 短时间内超过限流阈值 10 次，应该被自动拉黑 1 小时（返回 403）
  - 这验证了系统的"保护机制"是否正常工作
  </p>
  <p>
  运行方式：
  jmeter -n -t perf/jmx/N-P-08-rate-limit-degrade.jmx -l perf/results/N-P-08-result.jtl -e -o perf/results/N-P-08-report
  </p>
  <p>
  注意事项：
  - 运行此测试会将本机 IP 自动拉黑 1 小时，测试后需手动清除黑名单：
    redis-cli SREM rate_limit:blacklist:ip <本机IP>
  - 或等待 1 小时后自动解除
  - 建议测试顺序：先跑场景1（热点限流降级），再跑场景2（IP 自动拉黑）
  </p>
-->
<jmeterTestPlan version="1.2" properties="1.2" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="N-P-08 限流降级验证" enabled="true">
      <stringProp name="TestPlan.comments">目标：验证热点参数限流降级 + IP 自动拉黑机制</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <!-- 两个场景顺序执行：先验证热点限流降级，再验证 IP 拉黑 -->
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">8844</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="HOT_PRODUCT_ID" elementType="Argument">
            <stringProp name="Argument.name">HOT_PRODUCT_ID</stringProp>
            <stringProp name="Argument.value">10086</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ============================================================ -->
      <!-- 场景1：热点参数限流降级验证 -->
      <!-- <p> -->
      <!-- 用 500 并发、3000 QPS 持续压测热点商品 ID=10086，超过 Sentinel 配置的 2000 QPS 阈值 -->
      <!-- 预期：超过阈值后返回 Caffeine 缓存数据（HTTP 200 + 正常 JSON），而不是 429 错误 -->
      <!-- </p> -->
      <!-- ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景1-热点限流降级验证" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <!-- 持续 60 秒，足够触发限流和观察降级行为 -->
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- 吞吐量控制：3000 QPS（180000 per minute），超过热点商品 2000 QPS 阈值 -->
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="吞吐量控制 3000 QPS" enabled="true">
          <intProp name="calcMode">2</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>180000.0</value>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <!-- HTTP 请求默认值：配置服务器地址和端口 -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 请求默认值" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- HTTP 请求：GET /api/product/10086（热点商品） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="热点商品详情请求" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <stringProp name="HTTPSampler.path">/api/product/${HOT_PRODUCT_ID}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 请求头" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!--
            响应断言：接受 200（正常或缓存降级）
            小白理解：
            - 热点参数限流触发后，Sentinel 的 blockHandler 会返回 Caffeine 缓存数据
            - 缓存数据也是正常的 HTTP 200 响应，只是数据可能是稍旧的快照
            - 不应该出现 429 或 500 错误
          -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应码 200 断言（含缓存降级）" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="场景1-汇总报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ============================================================ -->
      <!-- 场景2：IP 自动拉黑验证 -->
      <!-- <p> -->
      <!-- 用单线程高频请求普通商品接口，超过 IP QPS 限制 10 次后，触发自动拉黑 -->
      <!-- 预期：拉黑后返回 403 Forbidden -->
      <!-- </p> -->
      <!-- <p> -->
      <!-- 小白理解： -->
      <!-- - 普通商品接口默认 IP QPS=50，我们用单线程每秒发 100 个请求 -->
      <!-- - 每秒超过 50 次 = 触发 1 次限流，持续 10 秒就会触发 10 次限流 -->
      <!-- - 达到 10 次阈值后，系统自动把本机 IP 加入黑名单，返回 403 -->
      <!-- - 黑名单有效期 1 小时，测试后可用 redis-cli SREM 清除 -->
      <!-- </p> -->
      <!-- ============================================================ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="场景2-IP自动拉黑验证" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <!-- 循环 2000 次，确保触发 10 次限流阈值 -->
          <stringProp name="LoopController.loops">2000</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">0</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <!--
          Constant Throughput Timer：6000 per minute = 100 QPS
          单线程 100 QPS，超过普通商品接口默认 IP QPS=50，每秒触发 50 次限流
          约 1 秒内就会达到 10 次限流阈值，触发自动拉黑
        -->
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="吞吐量控制 100 QPS" enabled="true">
          <intProp name="calcMode">0</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>6000.0</value>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <!-- HTTP 请求默认值：配置服务器地址和端口 -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 请求默认值" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- HTTP 请求：GET /api/product/4001（普通商品，默认 IP QPS=50） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="普通商品详情请求（触发限流）" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <stringProp name="HTTPSampler.path">/api/product/4001</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 请求头" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!--
            响应断言：接受 200（正常）、429（限流）、403（已拉黑）三种状态
            小白理解：
            - 测试开始时返回 200（还没触发限流）
            - 超过 IP QPS 后返回 429（限流拒绝）
            - 触发 10 次限流后返回 403（已被拉黑）
            - 这三种状态都是预期内的，测试目的是观察状态转换过程
          -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应码 200/429/403 断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
              <stringProp name="50026">429</stringProp>
              <stringProp name="49941">403</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <!-- test_type=24 表示 OR 模式（匹配任意一个即可） -->
            <intProp name="Assertion.test_type">24</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="场景2-汇总报告" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>